################################################################################
# Taps
################################################################################
tap 'ValeLint/vale'
tap 'getantibody/tap'
tap 'golangci/tap'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'koekeishiya/formulae'
tap 'universal-ctags/universal-ctags'


################################################################################
# Casks
################################################################################
# cask 'jce-unlimited-strength-policy'
# cask 'minikube'

cask_args appdir: '/Applications'

cask 'alfred'
cask 'bartender'
cask 'basictex'
cask 'better-window-manager'
cask 'carbon-copy-cloner'
cask 'cleanmymac'
cask 'coconutbattery'
cask 'colloquy'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'font-meslo-for-powerline'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'logitech-options'
cask 'marked'
cask 'microsoft-office'
cask 'monolingual'
cask 'omnidisksweeper'
cask 'omnigraffle'
cask 'onedrive'
cask 'onyx'
cask 'postman'
cask 'rowanj-gitx'
cask 'skitch'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'vagrant'
cask 'vienna'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'wireshark'
cask 'xquartz'


################################################################################
# Simple brews
################################################################################
# brew 'gnu-sed'
# brew 'kubernetes-cli'
# brew 'kubernetes-helm'
# brew 'redis', restart_service: :changed

brew 'ack'
brew 'ansible'
brew 'antibody'
brew 'autoconf'
brew 'automake'
brew 'bash'
brew 'berkeley-db'
brew 'boost'
brew 'chunkwm'
brew 'cmake'
brew 'coreutils'
brew 'exa'
brew 'extract_url'
brew 'findutils'
brew 'freetype'
brew 'fzf'
brew 'gawk', args: ["with-default-names"]
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'git-extras'
brew 'glib'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-tar'
brew 'gnutls'
brew 'go', args: ["cross-compile-common"]
brew 'golangci-lint'
brew 'googler'
brew 'grep'
brew 'gti'
brew 'hadolint'
brew 'htop'
brew 'httpie'
brew 'imagemagick'
brew 'jmeter', args: ["with-plugins"]
brew 'jpeg'
brew 'jq'
brew 'libevent'
brew 'libffi'
brew 'libmagic'
brew 'libpng'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libyaml'
brew 'lua@5.1'
brew 'luarocks'
brew 'mas'
brew 'nats-streaming-server'
brew 'neofetch'
brew 'neovim'
brew 'nmap'
brew 'node'
brew 'oniguruma'
brew 'openssl'
brew 'ossp-uuid'
brew 'pandoc'
brew 'par'
brew 'pcre'
brew 'perl'
brew 'pkg-config'
brew 'popt'
brew 'postgresql', restart_service: :changed
brew 'python'
brew 'ranger'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rg'
brew 'rpm'
brew 'ruby'
brew 's-lang'
brew 'sbt'
brew 'screen'
brew 'screenresolution'
brew 'shellcheck'
brew 'sip'
brew 'source-highlight'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'stern'
brew 'stern'
brew 'stow'
brew 'tcptraceroute'
brew 'telnet'
brew 'tidy-html5'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'universal-ctags', args: ["HEAD"]
brew 'utf8proc'
brew 'vale'
brew 'vault'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'xz'
brew 'zsh'


################################################################################
# Mac App Store
################################################################################
mas 'Blackmagic Disk Speed Test (3.1)', id: 425264550
mas 'Deliveries: a package tracker', id: 924726344
mas 'Microsoft Remote Desktop (8.0)', id: 715768417
mas 'Paprika Recipe Manager 3', id: 1303222628
mas 'Tweetbot (3.1)', id: 1384080005
mas 'feedly. Read more, know more.', id: 865500966
