################################################################################
# Taps
################################################################################
tap 'getantibody/tap'
tap 'golangci/tap'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'knqyf263/trivy'
tap 'koekeishiya/formulae'
tap 'universal-ctags/universal-ctags'


################################################################################
# Casks
################################################################################
cask_args appdir: '~/Applications'

# cask 'jce-unlimited-strength-policy'
# cask 'minikube'
# cask 'onedrive'
# cask 'marked'
# cask 'wireshark'
# cask 'carbon-copy-cloner'
# cask 'discord'

cask 'aerial'
cask 'alfred'
cask 'balenaetcher'
cask 'bartender'
cask 'basictex'
cask 'better-window-manager'
cask 'cleanmymac'
cask 'coconutbattery'
cask 'colloquy'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'font-meslo-for-powerline'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'java'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'microsoft-teams'
cask 'monolingual'
cask 'omnidisksweeper'
cask 'omnigraffle'
cask 'onyx'
cask 'postman'
cask 'rowanj-gitx'
cask 'skitch'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'textmate'
cask 'the-unarchiver'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'xquartz'


################################################################################
# Simple brews
################################################################################
# brew 'gnu-sed'
# brew 'gawk', args: ["with-default-names"]
# brew 'chunkwm'
# brew 'skhd'
# brew 'vim'

brew 'ack'
brew 'ansible'
brew 'ansible-lint'
brew 'antibody'
brew 'antlr'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'berkeley-db'
brew 'boost'
brew 'cmake'
brew 'cmatrix'
brew 'coreutils'
brew 'cowsay'
brew 'dive'
brew 'exa'
brew 'extract_url'
brew 'fd'
brew 'figlet'
brew 'findutils'
brew 'freetype'
brew 'fzf'
brew 'gawk'
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'git-extras'
brew 'glib'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'golangci-lint'
brew 'graphviz'
brew 'grep'
brew 'gzip'
brew 'hadolint'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'jpeg'
brew 'jq'
brew 'knqyf263/trivy/trivy'
brew 'less'
brew 'libevent'
brew 'libffi'
brew 'libmagic'
brew 'libpng'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libyaml'
brew 'lua@5.1'
brew 'luarocks'
brew 'make'
brew 'mas'
brew 'nats-streaming-server'
brew 'ncdu'
brew 'neofetch'
brew 'neovim'#, args: ["HEAD"]
brew 'nmap'
brew 'node'
brew 'oniguruma'
brew 'openssl'
brew 'ossp-uuid'
brew 'pandoc'
brew 'par'
brew 'pcre'
brew 'perl'
brew 'pkg-config'
brew 'popt'
brew 'postgresql', restart_service: :changed
brew 'prettier'
brew 'python'
brew 'python@2'
brew 'ranger'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rg'
brew 'rpm'
brew 'ruby'
brew 's-lang'
brew 'screen'
brew 'screenresolution'
brew 'shellcheck'
brew 'shfmt'
brew 'sip'
brew 'source-highlight'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'stern'
brew 'stow'
brew 'tcptraceroute'
brew 'telnet'
brew 'terraform'
brew 'tflint'
brew 'tidy-html5'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'universal-ctags', args: ["HEAD"]
brew 'utf8proc'
brew 'vault'
brew 'watch'
brew 'wdiff'
brew 'weechat'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'yq'
brew 'zsh'


################################################################################
# Mac App Store
################################################################################
mas 'Blackmagic Disk Speed Test (3.2)', id: 425264550
mas 'Deliveries (3.1.1)', id: 924726344
mas 'Keynote (9.1)', id: 409183694
mas 'Marked 2 (2.5.31)', id: 890031187
mas 'Microsoft Excel (16.22)', id: 462058435
mas 'Microsoft OneNote (16.22)', id: 784801555
mas 'Microsoft Outlook (16.22)', id: 985367838
mas 'Microsoft PowerPoint (16.22)', id: 462062816
mas 'Microsoft Remote Desktop (8.0.30030)', id: 715768417
mas 'Microsoft Word (16.22)', id: 462054704
mas 'Numbers (6.1)', id: 409203825
mas 'OneDrive (19.002.0107)', id: 823766827
mas 'Paprika Recipe Manager 3 (3.3.4)', id: 1303222628
mas 'Tweetbot (3.2)', id: 1384080005
mas 'feedly (1.1)', id: 865500966
