################################################################################
# Taps
################################################################################
#tap 'buo/cask-upgrade'
#tap 'filippo.io/age'
#tap 'getantibody/tap'
#tap 'golangci/tap'
tap 'hashicorp/tap'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'koekeishiya/formulae'
tap 'qmk/qmk'
tap 'snyk/tap'
tap 'osx-cross/avr'
tap 'osx-cross/arm'


################################################################################
# Casks
################################################################################

cask 'alacritty'
cask 'alfred'
cask 'balenaetcher'
cask 'bartender'
cask 'basictex'
cask 'better-window-manager'
cask 'cleanmymac'
cask 'coconutbattery'
cask 'docker', greedy: true
cask 'dropbox'
cask 'element'
cask 'firefox'
cask 'font-meslo-for-powerline'
cask 'font-meslo-lg-nerd-font'
cask 'font-roboto-mono-nerd-font'
cask 'font-sauce-code-pro-nerd-font'
cask 'google-chrome', greedy: true
cask 'insomnia'
cask 'istat-menus'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'lens'
cask 'omnidisksweeper'
cask 'omnigraffle'
cask 'onyx'
cask 'postman'
cask 'private-internet-access'
cask 'qmk-toolbox'
cask 'rowanj-gitx'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'textmate'
cask 'the-unarchiver'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'wez/wezterm/wezterm'


################################################################################
# Simple brews
################################################################################

brew 'ack'
brew 'age'
brew 'ansible'
brew 'ansible-lint'
brew 'antibody'
brew 'antlr'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'berkeley-db'
brew 'boost'
brew 'cmake'
brew 'cmatrix'
brew 'coreutils'
brew 'cowsay'
brew 'direnv'
brew 'dive'
brew 'exa'
brew 'fd'
brew 'figlet'
brew 'findutils'
brew 'flake8'
brew 'freetype'
brew 'fzf'
brew 'gawk'
brew 'gdbm'
brew 'gettext'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-extras'
brew 'glib'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'golangci-lint'
brew 'graphviz'
brew 'grep'
brew 'gzip'
brew 'hadolint'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'java'
brew 'jpeg'
brew 'jq'
brew 'k3d'
brew 'less'
brew 'libevent'
brew 'libffi'
brew 'libmagic'
brew 'libpng'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libyaml'
brew 'lua@5.1'
brew 'luarocks'
brew 'make'
brew 'markdownlint-cli'
brew 'mas'
brew 'nats-server'
brew 'ncdu'
brew 'neofetch'
brew 'ninja'
brew 'nmap'
brew 'node'
brew 'oniguruma'
brew 'openssl'
brew 'ossp-uuid'
brew 'pandoc'
brew 'par'
brew 'pcre'
brew 'perl'
brew 'pkg-config'
brew 'popt'
brew 'postgis'
brew 'postgresql', restart_service: :changed
brew 'prettier'
brew 'proselint'
brew 'pylint'
brew 'python'
brew 'qmk/qmk/qmk'
brew 'ranger'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rg'
brew 'rpm'
brew 'ruby'
brew 's-lang'
brew 'screen'
brew 'screenresolution'
brew 'shellcheck'
brew 'shellharden'
brew 'shfmt'
brew 'sip'
brew 'snyk'
brew 'sops'
brew 'source-highlight'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'stern'
brew 'stow'
brew 'stylua'
brew 'tcptraceroute'
brew 'telnet'
brew 'terraform'
brew 'terraform-docs'
brew 'terraform-ls'
brew 'terragrunt'
brew 'tflint'
brew 'tidy-html5'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'tree-sitter'
brew 'utf8proc'
brew 'vault'
brew 'watch'
brew 'wdiff'
brew 'weechat'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'yq'
brew 'zsh'


################################################################################
# Mac App Store
################################################################################
mas 'Blackmagic Disk Speed Test (3.2)', id: 425264550
mas 'Dark Reader for Safari (1.4.2)', id: 1438243180
mas 'Deliveries (3.1.1)', id: 290986013
mas 'HP Smart for Desktop (5.6.1)', id: 1474276998
mas 'Keynote (9.1)', id: 409183694
mas 'Marked 2 (2.5.31)', id: 890031187
mas 'Microsoft Excel (16.22)', id: 462058435
mas 'Microsoft OneNote (16.22)', id: 784801555
mas 'Microsoft Outlook (16.22)', id: 985367838
mas 'Microsoft PowerPoint (16.22)', id: 462062816
mas 'Microsoft Remote Desktop (10.3.11)', id: 1295203466
mas 'Microsoft Word (16.22)', id: 462054704
mas 'Numbers (6.1)', id: 409203825
mas 'OneDrive (19.002.0107)', id: 823766827
mas 'Paprika Recipe Manager 3 (3.3.4)', id: 1303222628
mas 'Tweetbot (3.2)', id: 1384080005
mas 'feedly (1.1)', id: 865500966
